# AdvancedMetal Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AdvancedMetal Properties
AdvancedMetal Class See Also
---
The AdvancedMetal type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MetalF0 | The property labeled "Reflectance" from the "AdvancedMetal" schema. |
| SurfaceAlbedo | The property labeled "Color" from the "AdvancedMetal" schema. |
| SurfaceAnisotropy | The property labeled "Anisotropy" from the "AdvancedMetal" schema. |
| SurfaceCutout | The property labeled "Image" from the "AdvancedMetal" schema. |
| SurfaceNdfType | The property labeled "NDF" from the "AdvancedMetal" schema. |
| SurfaceNormal | The property labeled "Image" from the "AdvancedMetal" schema. |
| SurfaceRotation | The property labeled "Rotation" from the "AdvancedMetal" schema. |
| SurfaceRoughness | The property labeled "Roughness" from the "AdvancedMetal" schema. |

# See Also
AdvancedMetal Class
Autodesk.Revit.DB.Visual Namespace